import { FC } from 'react'

interface Props {}

const TermsOfUsePage = () => (
  <>
    <div className='container'>
      <h1>ПРИЛОЖИМОСТ</h1>
      Настоящите Общи условия са приложими само за Услугата. Orderkloud.EU не носи отговорност за
      ПРЕДЛОЖЕНИЕТО. Чрез подаването на поръчка или заявка, клиентът сключва директно споразумение
      със заведението за поръчване на избраните от клиента предложения. ПРЕДЛОЖЕНИЕ Компонент от
      съвкупоността на предложения, които заведението предоставя(меню). ПРИЛОЖИМО ПРАВО
      Недействителност или неприложимост, на която и да е разпоредба от тези Общи условия няма да
      засяга действителността или приложимостта на останалите разпоредби. Към съдържанието на
      настоящите Общи условия се прилага действащото законодателство на Република България. При
      всяка поръчка или заявка от Orderkloud.EU, било то по през платформата или чрез мобилно
      приложение, Клиентът потвърждава, че е запознат/а и се съгласява с настоящите Общи условия.
      <h1>КАКВИ ЛИЧНИ ДАННИ ОБРАБОТВАМЕ И ЗАЩО</h1>
      Orderkloud.EU обработва вашите лични данни, защото използвате нашите услуги. Използваме
      следните лични данни за следните цели: Осъществяване на поръчка. Ние обработваме личните
      данни, които ни предоставяте, когато правите поръчка. Тези лични данни са необходими, за да
      бъде изпълнена, потвърдена и оценена поръчката. Правното основание за това обработване на
      лични данни е, че то е необходимо за изпълнението на договор, както е определено в GDPR. В
      процеса на поръчка обработваме следните лични данни: име(от Фейсбук профил) снимка(от Фейсбук
      профил) поръчка на коя маса се намирате в момента. коментари Осъществяване на заявка. В
      процеса на заявка обработваме следните лични данни: име(от Фейсбук профил) снимка(от Фейсбук
      профил) Тип заявка на коя маса се намирате в момента. коментари
      <h1>КАКВИ ТРЕТИ СТРАНИ ПОЛЗВАМЕ ЗА ОБРАБОТКА НА ДАННИ</h1>
      Използваме платформи само на утвърдени софтуерни компании - включващи, но не ограничаващи се
      до Google Analatics, Facebook АНАЛИЗ Също така използваме вашите лични данни, за да можем да
      изпълним задълженията си за отчитане към рекламодателите и за да можем да подобрим нашата
      платформа и гама от продукти и услуги. Правното основание за тази обработка е, че е необходимо
      да се преследва законният интерес на Orderkloud.EU (анализ и отчитане), както е определено в
      GDPR. Отчетите не съдържат данни, които биха могли да ви идентифицират поименно. ВЪЗРАСТ
      Нашата платформа не е предназначена за лица на възраст под 16 години и нямаме намерение да
      събираме лични данни на посетители на уебсайта, които са под 16-годишна възраст. В
      несъстоятелност сме обаче да проверим действителната възраст на посетителите. Ето защо
      съветваме родителите да наблюдават онлайн действията на децата си, за да предотвратят
      предоставянето на личните им данни без съгласието на родителите. Ако считате, че сме събрали
      лични данни на непълнолетен без съгласие, моля, свържете се с нас на адрес
      hello@orderkloud.eu. В резултат ще предприемем изтриване на тези данни.
      <h1>ПЕРИОД НА СЪХРАНЕНИЕ НА ЛИЧНИТЕ ВИ ДАННИ </h1>
      Orderkloud.EU няма да съхранява личните ви данни за по-дълъг период от необходимото за
      изпълнение на целите, за които са събрани данните. Ние ще съхраняваме вашите лични данни за
      по-дълго време само в случай, че сме длъжни по закон да го направим. Orderkloud.EU изтрива
      повечето от всички ваши лични данни до 2 месеца след като сте направили поръчката си.
      Използваме този двумесечен срок за административни цели и за да можем да отговорим на
      евентуални въпроси и оплаквания относно поръчката ви, отправени от вас или от заведения.
      Заведенията, с които работим имат достъп до поръчката ви до 27 часа след като е
      направена(освен ако нямат повече от 150 поръчки за въпросния период).
      <h1>СПОДЕЛЯНЕ СЪС ЗАВЕДЕНИЯ</h1>
      Orderkloud.EU споделя вашите лични данни (Фейсбук профил, номер на маса, поръчка) с избраното
      от Вас заведение, така че заведението да може да изпълнивашата поръчка. Тъй като сте директен
      клиент на заведението, то носи своя отговорност и има свои задължения по отношение на
      обработката на вашите лични данни. Ако имате въпроси относно начина, по който заведението
      обработва вашите лични данни, трябва да се свържете директно с ресторанта. Заведенията имат
      достъп до поръчката Ви(включително лични данни) до 27 часа след извършването й, но ако ни
      попитат в рамките на 2 месеца, след като се е случила, във връзка със законни цели или
      организиране на томболи за награди или идентификация на фалшиви поръчки, ние ще им предоставим
      отново достъп до въпросната поръчка.
      <h1>СПОДЕЛЯНЕ С ДРУГИ (ОСВЕН ЗАВЕДЕНИЯ)</h1>
      Orderkloud.EU няма да продава по никакъв начин вашите лични данни на трети страни, обаче
      запазва правото си да прави отчети на поръчките, преминали през платформата, но в тях не се
      включва фейсбук профила Ви(име и снимка), а ако по името Ви алгоритъма ни успее да
      идентифицира пола Ви, само него.
      <h1>ДОСТЪП ДО ЛИЧНИ ДАННИ, КОРИГИРАНЕ И ИЗТРИВАНЕ</h1>
      Имате право на достъп до всички лични данни, които събираме за вас, както и правото да
      поискате да ги коригираме или изтрием. Ако смятате, че обработваме вашите лични данни без
      валидно правно основание, или че обработваме лични данни, които не са от значение за процеса
      ни на работа, моля свържете се с нас. Можете да се свържете с hello@orderkloud.eu.
      Orderkloud.EU ще отговори на вашето искане възможно най-скоро и във всеки случай не по-късно
      от четири седмици след получаване на вашата заявка.
      <h1>ПРЕПОРЪКИ, ВЪПРОСИ И ОПЛАКВАНИЯ</h1>В случай, че имате други въпроси или оплаквания
      относно обработката на вашите лични данни, ние ще се радваме да разговаряме. Ние също бихме
      искали да чуем от вас съвети или предложения как да подобрим нашата политика за поверителност.
      СИГУРНОСТ Orderklod.EU се отнася много сериозно към защитата на личните данни и в тази връзка
      предприемаме подходящи мерки за защита на вашите лични данни срещу злоупотреба, загуба,
      неоторизиран достъп, нежелано разкриване и неупълномощени промени. Ако смятате, че вашите
      лични данни не са адекватно защитени или има индикации за неправилна употреба, моля свържете
      се с нас на адрес: hello@orderkloud.eu
      <h1>ДАННИ ЗА КОНТАКТ</h1>
      Офис +359 88 59 29 379 hello@orderkloud.eu
      <h1>ДЛЪЖНОСТНО ЛИЦЕ ПО ЗАЩИТА НА ЛИЧНИТЕ ДАННИ</h1>
      Кирил Йорданов, съсобственик и управител на Orderkloud.EU +359 87 906 4002
      kirilkalinovjordanov@gmail.com
    </div>
  </>
)

export default TermsOfUsePage
